<?php
    include('functions/check-login.php');
?>

<?php
    $type_regis = $_GET['type'];
?>

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Thavorn Jewelry</title>

    <link rel="stylesheet" href="../css/register.min.css?v=1.02">
</head>
<body>
    <div class="login">
        <div class="left">
            <div class="logo">
                <img src="../asset/img/logo-gem.png" alt="">
            </div>
        </div>

        <div class="right">
            <div class="logo-mobile">
                <img src="../asset/img/logo-gem.png" alt="">
            </div>

            <div class="box-pdpa">
                <h1>นโยบายความเป็นส่วนตัว</h1>
                <p class="cen">(Privacy Policy)</p>
                
                <div class="box-content">
                    <h2>1.ข้อมูลส่วนบุคคลของท่านที่บริษัทเก็บรวบรวม</h2>
                    <p>
                        บริษัทอาจเก็บรวบรวมข้อมูลส่วนบุคคลประเภทต่าง ๆ ของท่าน โดยตรงจากท่านหรือโดยอ้อมจากแหล่งข้อมูลอื่น ๆ โดยตัวอย่างประเภทของข้อมูลส่วนบุคคลที่บริษัทอาจเก็บรวบรวม ใช้ เปิดเผย ดังต่อไปนี้
                    </p>
                    <div class="box">
                        <p>1. ข้อมูลส่วนตัว เช่น คำนำหน้า ชื่อ-นามสกุล อายุ วันเดือนปีเกิด เพศ  รูปถ่าย ลายมือชื่อ</p>
                        <p>2. ข้อมูลติดต่อ เช่น ที่อยู่ทางทะเบียน ที่อยู่ที่พักอาศัย ที่อยู่ทางธุรกิจ ที่อยู่ทางไปรษณีย์ หมายเลขโทรศัพท์ หมายเลขโทรศัพท์ทางธุรกิจ หมายเลขโทรศัพท์มือถือ หมายเลขโทรสาร อีเมล รหัสไปรษณีย์ ข้อมูลบัญชีผู้ใช้โซเชียลมีเดีย (เช่น ข้อมูลบัญชีผู้ใช้ไลน์) และข้อมูลติดต่อทางอิเล็กทรอนิกส์อื่น ๆ</p>
                        <p>3. ข้อมูลที่ระบุตัวตนที่ออกโดยทางราชการ เช่น เลขที่บัตรประจำตัวประชาชน เลขที่หนังสือเดินทาง เลขที่ประจำตัวผู้เสียภาษีอากร เลขที่ประกันสังคม รวมถึงข้อมูลจากใบอนุญาตขับขี่รถยนต์ ทะเบียนบ้าน หนังสือรับรองบริษัท (ที่ระบุรายชื่อกรรมการบริษัท) หรือข้อมูลอื่นที่คล้ายคลึงกัน </p>
                        <p>4. ข้อมูลเกี่ยวกับพฤติกรรม เช่น ข้อมูลเกี่ยวกับพฤติกรรมการซื้อของลูกค้า และข้อมูลที่ได้รับจากการใช้ผลิตภัณฑ์ สินค้าและบริการของบริษัท</p>
                        <p>5. ข้อมูลทางการเงิน เช่น ข้อมูลพร้อมเพย์ บัญชีธนาคาร</p>
                        <p>6. ข้อมูลการทำธุรกรรมที่สำคัญ เช่น ประวัติการซื้อ จำนวนเงินในการซื้อ พฤติกรรมการซื้อ และ/หรือ ใช้ผลิตภัณฑ์ สินค้า และบริการของบริษัท</p>
                        <p>7. ข้อมูลที่เก็บจากอุปกรณ์อิเล็กทรอนิกส์ของท่าน เช่น เลขที่อยู่ไอพีหรืออินเทอร์เน็ตโพรโทคอล (IP address)</p>
                        <p>8. ข้อมูลโพรไฟล์ เช่น ชื่อบัญชี (Account identifiers) ชื่อผู้ใช้และรหัสผ่าน รหัสประจำตัว (PIN ID code) สำหรับการซื้อขายผลิตภัณฑ์ สินค้า และบริการของบริษัท</p>
                    </div>
                    <p>
                        หากท่านได้ให้ข้อมูลส่วนบุคคล  (เช่น ชื่อ นามสกุล ที่อยู่ และข้อมูลติดต่อ)  ของบุคคลอื่น เช่น ผู้ติดต่อในกรณีฉุกเฉิน คู่สมรส ภรรยา บุพการี ผู้สืบสันดาน ญาติ บุตร นายจ้าง ตัวแทน ผู้รับประโยชน์ หรือบุคคลผู้อ้างอิง ในกรณีลูกค้าบุคคลธรรมดาหรือ ลูกจ้าง ผู้ถือหุ้น กรรมการหรือบุคคลที่เกี่ยวข้องกับองค์กรของท่าน ในกรณีของลูกค้าองค์กร แก่บริษัท ท่านควรมั่นใจว่าท่านมีสิทธิ และ/หรือ อำนาจที่จะให้ข้อมูลส่วนบุคคลดังกล่าว และอนุญาตให้บริษัทใช้ข้อมูลส่วนบุคคลดังกล่าวตามนโยบายความเป็นส่วนตัวฉบับนี้ได้ อีกทั้งท่านต้องรับผิดชอบในการแจ้งบุคคลเหล่านั้นให้ทราบถึงนโยบายความเป็นส่วนตัวฉบับนี้ และ/หรือขอความยินยอมจากบุคคลเหล่านั้น หากจำเป็น และ/หรือ อาศัยหลักเกณฑ์หรือฐานทางกฎหมายอื่น
                    </p>
                    <p>
                        บริษัทจะไม่เก็บรวบรวมข้อมูลส่วนบุคคลของผู้เยาว์ (ที่ยังไม่บรรลุนิติภาวะ กล่าวคือ อายุไม่ถึง 20 ปีบริบูรณ์ หรือยังไม่บรรลุนิติภาวะโดยการสมรสตามที่กฎหมายกำหนด) คนเสมือนไร้ความสามารถ คนไร้ความสามารถ และไม่อนุญาตให้บุคคลดังกล่าวสมัครเพื่อใช้หรือซื้อผลิตภัณฑ์ สินค้าและบริการของบริษัท หากไม่ได้รับความยินยอมหรือหากไม่ได้อาศัยฐานทางกฎหมายอื่นใด ทั้งนี้หากบริษัททราบว่า บริษัทได้บังเอิญเก็บรวบรวมข้อมูลส่วนบุคคลจากบุคคลเหล่านี้ โดยมิได้รับความยินยอมและโดยไม่ได้อาศัยฐานทางกฎหมายอื่นใด บริษัทจะดำเนินการลบข้อมูลส่วนบุคคลดังกล่าวทันทีที่บริษัททราบถึงกรณีดังกล่าว และอาจจำเป็นต้องหยุดให้บริการบุคคลเหล่านี้ เว้นแต่กรณีที่บริษัทอาจอาศัยหลักเกณฑ์หรือฐานทางกฎหมายอื่นนอกเหนือจากความยินยอมได้
                    </p>
                </div>

                <div class="box-content">
                    <h2>2.แหล่งที่มาของข้อมูล</h2>
                    <div class="box">
                        <p>1.ข้อมูลจากเจ้าของข้อมูลโดยตรง ที่ท่านได้ให้ไว้ในกิจกรรมต่าง ๆ เช่น เว็บไซต์</p>
                    </div>
                </div>
                
                <div class="box-content">
                    <h2>3.วัตถุประสงค์ในการประมวลผลข้อมูลส่วนบุคคล</h2>
                    <p>บริษัทฯอาจนำข้อมูลส่วนบุคคลไปใช้ตามวัตถุประสงค์ดังต่อไปนี้หรือตามวัตถุประสงค์อื่น ๆ  ที่แจ้งขณะเก็บรวบรวมข้อมูลหรือที่ท่านได้ให้ความยินยอมหลังจากบริษัทฯดำเนินการเก็บข้อมูลไปแล้ว</p>
                    <div class="box">
                        <p>1. การลงทะเบียนและการยืนยันตัวตน เช่น เพื่อลงทะเบียน ตรวจสอบ ยืนยัน และรับรองตัวตนของท่าน</p>
                        <p>2. ดำเนินกิจกรรมใด ๆ ทางบัญชีและการเงิน เช่น การตรวจสอบบัญชี การแจ้งและเรียกเก็บหนี้ การออกใบกำกับภาษี และหลักฐานการดำเนินธุรกรรมต่าง ๆ ที่กฎหมายกำหนด</p>
                        <p>3. การลงทะเบียนและการยืนยันตัวตน เช่น เพื่อลงทะเบียน ตรวจสอบ ยืนยัน และรับรองตัวตนของท่าน</p>
                        <p>4. เพื่อติดต่อและสื่อสารกับท่าน เช่น เพื่อใช้ในการติดต่อ ประสานงาน ให้บริการ ประชาสัมพันธ์ นำเสนอข้อมูลทางการตลาด การขาย ข้อเสนอพิเศษ โปรโมชั่น การแจ้งเตือน ข่าวสาร และข้อมูลเกี่ยวกับผลิตภัณฑ์ สินค้า และบริการของบริษัทให้แก่ท่าน</p>
                    </div>
                </div>

                <div class="box-content">
                    <h2>4.การปกป้องข้อมูลส่วนบุคคล</h2>
                    <p>บริษัทฯ ได้จัดทำและ/หรือเลือกใช้ระบบการจัดเก็บข้อมูลส่วนบุคคลให้มีกลไกและเทคนิคที่เหมาะสม พร้อมทั้งมีมาตรการรักษาความมั่นคงปลอดภัยตามกฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล และกฎหมายที่เกี่ยวข้อง รวมทั้งจำกัดการเข้าถึงข้อมูลส่วนบุคคลของท่านจากพนักงาน ลูกจ้าง และตัวแทนของบริษัทฯ เพื่อป้องกันไม่ให้ข้อมูลส่วนบุคคลของท่านถูกนำไปใช้ เปิดเผย ทำลาย หรือเข้าถึงโดยไม่ได้รับอนุญาต</p>
                </div>

                <div class="box-content">
                    <h2>5.ระยะเวลาในการจัดเก็บข้อมูล</h2>
                    <p>บริษัทฯจะเก็บรวบรวมข้อมูลส่วนบุคคลของท่านไว้ตลอดระยะเวลาตราบเท่าที่จำเป็นต่อการประมวลผลตามวัตถุประสงค์ในนโยบายฉบับนี้เท่านั้น เว้นแต่มีความจำเป็นต้องเก็บข้อมูลส่วนบุคคลไว้ด้วยเหตุอื่นใด เช่น เพื่อปฏิบัติตามกฎหมายหรือการตรวจสอบกรณีการเกิดข้อพิพาท บริษัทฯอาจมีความจำเป็นต้องเก็บข้อมูลไว้เป็นระยะเวลาเกินกว่าที่ระบุ</p>
                </div>

                <div class="box-content">
                    <h2>6.สิทธิของท่านในฐานะเจ้าของข้อมูลส่วนบุคคล</h2>
                    <div class="box">
                        <p>1. การเข้าถึง ท่านอาจมีสิทธิในการขอเข้าถึงหรือขอรับสำเนาข้อมูลส่วนบุคคลที่บริษัทเก็บรวบรวม ใช้หรือเปิดเผยเกี่ยวกับท่าน</p>
                        <p>2. การแก้ไขให้ถูกต้อง ท่านอาจมีสิทธิขอให้มีการดำเนินการแก้ไขข้อมูลส่วนบุคคลที่บริษัทได้เก็บรวบรวม ใช้หรือเปิดเผยเกี่ยวกับท่าน ให้ ถูกต้อง เป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด</p>
                        <p>3. การคัดค้าน ท่านอาจมีสิทธิคัดค้านการเก็บรวบรวม ใช้หรือเปิดเผยข้อมูลส่วนบุคคลของท่านทั้งนี้ เป็นไปตามที่กฎหมายที่ใช้บังคับกำหนด</p>
                        <p>4. การระงับการใช้ ท่านอาจมีสิทธิขอให้ระงับการใช้ข้อมูลส่วนบุคคลของท่านในบางกรณี</p>
                        <p>5. การถอนความยินยอม สำหรับวัตถุประสงค์ที่ท่านได้ให้ความยินยอมให้บริษัทเก็บรวบรวม ใช้หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน ท่านอาจมีสิทธิที่จะถอนความยินยอมของท่าน ในบางกรณี</p>
                        <p>6. การลบหรือทำลาย ท่านอาจมีสิทธิขอให้บริษัทดำเนินการลบ ทำลาย หรือทำให้ข้อมูลส่วนบุคคลของท่านที่บริษัทเก็บรวบรวม ใช้หรือเปิดเผย เป็นข้อมูลส่วนบุคคลที่ไม่สามารถระบุตัวท่านได้ เว้นแต่การเก็บรักษาข้อมูลส่วนบุคคลดังกล่าวของบริษัทนั้นเป็นไปเพื่อการปฏิบัติตามกฎหมาย หรือเพื่อก่อตั้งสิทธิเรียกร้องตามกฎหมาย เพื่อการใช้ หรือการปกป้องสิทธิเรียกร้องตามกฎหมาย</p>
                        <p>7. การร้องเรียน ท่านมีสิทธิร้องเรียนไปยังหน่วยงานของรัฐที่เกี่ยวข้องกับการคุ้มครองข้อมูลส่วนบุคคล ในกรณีที่ท่านเชื่อว่าบริษัทไม่ปฏิบัติตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล</p>
                    </div>
                </div>

                <div class="box-content">
                    <h2>7.ติดต่อบริษัท</h2>
                    <p>หากท่านประสงค์จะใช้สิทธิที่เกี่ยวข้องกับข้อมูลส่วนบุคคลของท่าน หรือมีข้อสงสัยเกี่ยวกับข้อมูลส่วนบุคคลของท่านภายใต้นโยบายความเป็นส่วนตัวฉบับนี้ โปรดติดต่อบริษัทที่</p>

                    <p>156-160 ถนนศรีจันทร์</p>
                    <p>อำเภอเมือง จังหวัดขอนแก่น</p>
                    <p>40000</p>
                    <p>โทรศัพท์: 043-225-579</p>
                    <p>Email: thavornjew@gmail.com</p>
                </div>
            </div>
        </div>
    </div>

    <script src="../../plugins/jquery/jquery.min.js"></script>
    <script src="../../plugins/sweetalert2/sweetalert2.all.min.js"></script>
    <script src="js/register.js"></script>
</body>
</html>